# RiserCurveTooShort Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RiserCurveTooShort Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Riser curve is too short to create nosing on it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RiserCurveTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RiserCurveTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RiserCurveTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace